; domain
;; Specification in PDDL1 of the DWR domain

(define (domain dock-worker-robot-simple)
 (:requirements :strips :typing )
 (:types 
  location      ; there are several connected locations in the harbor 
  robot         ; holds at most 1 container, only 1 robot per location
  container)

 (:predicates
   (adjacent ?l1  ?l2 - location)       ; location ?l1 is adjacent ot ?l2
   (atl ?r - robot ?l - location)       ; robot ?r is at location ?l
   (loaded ?r - robot ?c - container )  ; robot ?r is loaded with container ?c
   (unloaded ?r - robot)                ; robot ?r is empty
   (in ?c - container ?l - location)    ; container ?c is within location ?l
   )

;; there are 3 operators in this domain:

;; moves a robot between two adjacent locations
 (:action move                                
     :parameters (?r - robot ?from ?to - location)
     :precondition (and (adjacent ?from ?to) (atl ?r ?from) )
     :effect (and (atl ?r ?to)
                    (not (atl ?r ?from)) ))

;; loads an empty robot with a container held by a nearby crane
 (:action load                                
     :parameters (?l - location ?c - container ?r - robot)
     :precondition (and (atl ?r ?l) (in ?c ?l) (unloaded ?r))
     :effect (and (loaded ?r ?c)
                    (not (in ?c ?l)) (not (unloaded ?r)) ))

;; unloads a robot holding a container with a nearby crane
 (:action unload                                 
     :parameters (?l - location ?c - container ?r - robot)
     :precondition (and (atl ?r ?l) (loaded ?r ?c) )
     :effect (and (unloaded ?r) (in ?c ?l)
                    (not (loaded ?r ?c)) )) )

; problem
;; a simple DWR problem with 2 robots and 2 locations
(define (problem dwrpb1)
  (:domain dock-worker-robot-simple)

  (:objects
   robr robq - robot
   loc1 loc2 - location
   conta contb - container)

  (:init
   (adjacent loc1 loc2)
   (adjacent loc2 loc1)

   (in conta loc1)
   (in contb loc2)

   (atl robr loc1)
   (atl robq loc2)

   (unloaded robr)
   (unloaded robq)
   )

;; the task is to move all containers to locations l2
;; ca and cc in pile p2, the rest in q2
  (:goal
    (and
        (in contb loc1)
	    (loaded robr conta)
	    )) )

; plan
1. (load loc2 contb robq)
   deleted: (in contb loc2) (unloaded robq)
   added: (loaded robq contb)
   goals met: 0 of 2
2. (move robq loc2 loc1)
   deleted: (atl robq loc2)
   added: (atl robq loc1)
   goals met: 0 of 2
3. (load loc1 conta robr)
   deleted: (in conta loc1) (unloaded robr)
   added: (loaded robr conta)
   goals met: 1 of 2
4. (unload loc1 contb robq)
   deleted: (loaded robq contb)
   added: (unloaded robq) (in contb loc1)
   goals met: 2 of 2
